In [1]:
import numpy as np
import pandas as pd

In [2]:
# A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

# Features of DataFrame
# Potentially columns are of different types
# Size â€“ Mutable
# Labeled axes (rows and columns)
# Can Perform Arithmetic operations on rows and columns

In [3]:
from numpy.random import randn

In [4]:
#np.random.seed(101)

In [20]:
df  = pd.DataFrame(randn(5,5),['A','B','C','D','E'],['W','X','Y','Z','O'])

In [21]:
df

          W         X         Y         Z         O
A  0.649148  0.358941 -1.080471  0.902398  0.161781
B  0.833029  0.975720 -0.388239  0.783316 -0.708954
C  0.586847 -1.621348  0.677535  0.026105 -1.678284
D  0.333973 -0.532471  2.117727  0.197524  2.302987
E  0.729024 -0.863091  0.305632  0.243178  0.864165

In [22]:
df['W']      # This will show the "W" column of "df" Dataframe

A    0.649148
B    0.833029
C    0.586847
D    0.333973
E    0.729024
Name: W, dtype: float64

In [23]:
type(df['W'])             # This tells use the type of dataframe

pandas.core.series.Series

In [24]:
df[['W','Y']]

          W         Y
A  0.649148 -1.080471
B  0.833029 -0.388239
C  0.586847  0.677535
D  0.333973  2.117727
E  0.729024  0.305632

In [26]:
df['new'] = df['W'] + df['Y']           # Adding new column named "new" by adding two existing columns W and Y

In [27]:
df

          W         X         Y         Z         O       new
A  0.649148  0.358941 -1.080471  0.902398  0.161781 -0.431324
B  0.833029  0.975720 -0.388239  0.783316 -0.708954  0.444791
C  0.586847 -1.621348  0.677535  0.026105 -1.678284  1.264382
D  0.333973 -0.532471  2.117727  0.197524  2.302987  2.451700
E  0.729024 -0.863091  0.305632  0.243178  0.864165  1.034655

In [29]:
df.drop('new',axis=1)

          W         X         Y         Z         O
A  0.649148  0.358941 -1.080471  0.902398  0.161781
B  0.833029  0.975720 -0.388239  0.783316 -0.708954
C  0.586847 -1.621348  0.677535  0.026105 -1.678284
D  0.333973 -0.532471  2.117727  0.197524  2.302987
E  0.729024 -0.863091  0.305632  0.243178  0.864165

In [30]:
df['new'] = df['W'] + df['Y']

In [31]:
df

          W         X         Y         Z         O       new
A  0.649148  0.358941 -1.080471  0.902398  0.161781 -0.431324
B  0.833029  0.975720 -0.388239  0.783316 -0.708954  0.444791
C  0.586847 -1.621348  0.677535  0.026105 -1.678284  1.264382
D  0.333973 -0.532471  2.117727  0.197524  2.302987  2.451700
E  0.729024 -0.863091  0.305632  0.243178  0.864165  1.034655

In [33]:
df.drop('new',axis=1)

          W         X         Y         Z         O
A  0.649148  0.358941 -1.080471  0.902398  0.161781
B  0.833029  0.975720 -0.388239  0.783316 -0.708954
C  0.586847 -1.621348  0.677535  0.026105 -1.678284
D  0.333973 -0.532471  2.117727  0.197524  2.302987
E  0.729024 -0.863091  0.305632  0.243178  0.864165

In [34]:
df

          W         X         Y         Z         O       new
A  0.649148  0.358941 -1.080471  0.902398  0.161781 -0.431324
B  0.833029  0.975720 -0.388239  0.783316 -0.708954  0.444791
C  0.586847 -1.621348  0.677535  0.026105 -1.678284  1.264382
D  0.333973 -0.532471  2.117727  0.197524  2.302987  2.451700
E  0.729024 -0.863091  0.305632  0.243178  0.864165  1.034655

In [35]:
df.drop('new',axis=1,inplace=True)       # to drop col permanently add "inplace=True" , otherwise it would not drop permanently

In [36]:
df

          W         X         Y         Z         O
A  0.649148  0.358941 -1.080471  0.902398  0.161781
B  0.833029  0.975720 -0.388239  0.783316 -0.708954
C  0.586847 -1.621348  0.677535  0.026105 -1.678284
D  0.333973 -0.532471  2.117727  0.197524  2.302987
E  0.729024 -0.863091  0.305632  0.243178  0.864165

In [37]:
# The axis are axis= 0 or 1, In case of row , axis=0 and in case of col , axis=1 because the shape of DataFrame is tupple which is (rows ,cols), so rows is at index 0 and cols are at index 1

In [48]:
# Selecting Rows

In [ ]:
# loc => location => not takes numeric index

In [46]:
df.loc['A']         # loc[] is the fun that takes the location of index which you want to select. Here in my case i want to select row A that's why loc['A'] is used
                    # Note: This is only for rows not for columns

W    0.649148
X    0.358941
Y   -1.080471
Z    0.902398
O    0.161781
Name: A, dtype: float64

In [49]:
# iloc => I location => takes numeric index

In [50]:
df.iloc[2]                          # This is the index of C.

W    0.586847
X   -1.621348
Y    0.677535
Z    0.026105
O   -1.678284
Name: C, dtype: float64

In [51]:
df.loc['B','Y']

-0.38823869993016363

In [52]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.649148 -1.080471
B  0.833029 -0.388239